{
  "irVersion": "1.0",
  "project": "agentsentinel",
  "repository": "https://github.com/plexusone/agentsentinel",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-03-28",
      "highlights": [
        { "description": "Testable architecture with dependency injection via interfaces" },
        { "description": "Comprehensive MkDocs documentation site with Material theme" },
        { "description": "Context-based colored logging with configurable log levels" }
      ],
      "added": [
        { "description": "`detector.IsKiroPrompt()` exported helper function for checking Kiro CLI prompt format", "commit": "5973e88" },
        { "description": "`--level` flag for log level control (debug, info, warn, error)", "commit": "4e61f5f" },
        { "description": "Colored log output via `github.com/lmittmann/tint`", "commit": "4e61f5f" },
        { "description": "Context-based logging via `github.com/grokify/mogo/log/slogutil`", "commit": "4e61f5f" },
        { "description": "MkDocs documentation site with Material theme, dark/light mode, and search", "commit": "788dd31" }
      ],
      "changed": [
        { "description": "Extracted watcher logic from `cmd/watch.go` to `internal/watcher` package with dependency injection", "commit": "4e61f5f" },
        { "description": "Added `TmuxClient`, `Notifier`, and `StatsRecorder` interfaces for testability", "commit": "4e61f5f" },
        { "description": "Configurable `RecentWindow` and `CleanupWindow` for duplicate prevention", "commit": "4e61f5f" }
      ],
      "documentation": [
        { "description": "MkDocs site with Getting Started, Usage, Reference, and Troubleshooting sections", "commit": "788dd31" },
        { "description": "Architecture diagram (D2 source and SVG) showing package structure and data flow", "commit": "6fbc46f" },
        { "description": "Comprehensive pattern reference table (19 detection + 13 danger patterns)", "commit": "6fbc46f" },
        { "description": "CLAUDE.md project guidelines for AI agents", "commit": "85d10be" },
        { "description": "Godoc comments for all exported types and functions in internal packages", "commit": "8da8ac3" }
      ],
      "tests": [
        { "description": "Unit tests for `internal/watcher` package (85.3% coverage)", "commit": "4e61f5f" },
        { "description": "Unit tests for `internal/config` package (73.9% coverage)", "commit": "2c2cd3d" },
        { "description": "Unit tests for `internal/stats` package (88.7% coverage)", "commit": "2c2cd3d" },
        { "description": "Unit tests for `internal/notify` package (50.0% coverage)", "commit": "2c2cd3d" },
        { "description": "TestIsKiroPrompt test cases for detector", "commit": "5973e88" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-03-07",
      "highlights": [
        { "description": "Auto-approve tool requests for AI coding CLIs (Kiro, Claude Code, Codex, Gemini) running in tmux" },
        { "description": "Kiro multi-subagent support - automatically cycles through and approves all concurrent subagents" }
      ],
      "added": [
        { "description": "`watch` command to monitor tmux panes for tool approval prompts and auto-approve them", "commit": "cd362d9" },
        { "description": "`status` command to display tmux environment and available panes", "commit": "cd362d9" },
        { "description": "`test` command to verify prompt detection patterns are working", "commit": "cd362d9" },
        { "description": "`config` command group for configuration management (path, show, init, example)", "commit": "cd362d9" },
        { "description": "`stats` command to track approval statistics during watch sessions", "commit": "cd362d9" },
        { "description": "`version` command to display build information", "commit": "cd362d9" },
        { "description": "Support for AWS Kiro CLI approval prompts (`tool use ... requires approval, press 'y' to approve`)", "commit": "cd362d9" },
        { "description": "Support for Claude Code approval prompts (`Allow? (Y/n)`, `Allow once`)", "commit": "cd362d9" },
        { "description": "Support for Codex CLI approval prompts (`Proceed? (Y/n)`)", "commit": "cd362d9" },
        { "description": "Support for Gemini CLI approval prompts (`(Y/n)` prompts)", "commit": "cd362d9" },
        { "description": "Kiro multi-subagent TUI support with automatic cycling through all pending approvals", "commit": "86b4379" },
        { "description": "Detection count for multiple concurrent approval prompts in same pane", "commit": "86b4379" },
        { "description": "`ApproveMultiple()` function for navigating and approving multiple prompts", "commit": "86b4379" },
        { "description": "Dangerous command blocking for `rm -rf`, `sudo rm`, `mkfs`, `dd if=`, `curl|bash`, `wget|sh`, `chmod -R 777 /`", "commit": "cd362d9" },
        { "description": "Dry-run mode (`--dry-run`) to test detection without sending approvals", "commit": "cd362d9" },
        { "description": "Configurable scan interval (`--interval`) for responsive approval", "commit": "cd362d9" },
        { "description": "Session filtering (`--session`) to watch specific tmux sessions", "commit": "cd362d9" },
        { "description": "Verbose logging (`-v/--verbose`) for debugging", "commit": "cd362d9" },
        { "description": "macOS notifications support (`--notify`) for approval events", "commit": "cd362d9" },
        { "description": "Statistics tracking (`--stats`) with session summaries", "commit": "cd362d9" },
        { "description": "Duplicate approval prevention to avoid multiple keystrokes", "commit": "cd362d9" },
        { "description": "YAML configuration file support (`~/.agentsentinel.yaml`)", "commit": "cd362d9" },
        { "description": "Custom pattern configuration for additional prompt formats", "commit": "cd362d9" },
        { "description": "Shell completion scripts for bash, zsh, and fish", "commit": "cd362d9" }
      ],
      "fixed": [
        { "description": "Kiro multi-subagent cycling now covers all items regardless of cursor starting position", "commit": "6ea6369" }
      ],
      "documentation": [
        { "description": "Comprehensive README with quick start guide and multi-agent workflow examples", "commit": "3305791" },
        { "description": "Configuration file documentation with full example", "commit": "3305791" },
        { "description": "Troubleshooting guide for common issues", "commit": "3305791" }
      ],
      "build": [
        { "description": "GoReleaser configuration for multi-platform binary releases", "commit": "77ca6fa" },
        { "description": "GitHub Actions CI workflow for testing and linting", "commit": "77ca6fa" },
        { "description": "Makefile with build, test, lint, and install targets", "commit": "77ca6fa" }
      ],
      "tests": [
        { "description": "Multi-subagent count detection test cases", "commit": "86b4379" }
      ]
    }
  ]
}
