{
  "irVersion": "1.0",
  "project": "agentsentinel",
  "repository": "https://github.com/plexusone/agentsentinel",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.1.0",
      "date": "2026-03-07",
      "highlights": [
        { "description": "Auto-approve tool requests for AI coding CLIs (Kiro, Claude Code, Codex, Gemini) running in tmux" }
      ],
      "added": [
        { "description": "`watch` command to monitor tmux panes for tool approval prompts and auto-approve them", "commit": "cd362d9" },
        { "description": "`status` command to display tmux environment and available panes", "commit": "cd362d9" },
        { "description": "`test` command to verify prompt detection patterns are working", "commit": "cd362d9" },
        { "description": "`config` command group for configuration management (path, show, init, example)", "commit": "cd362d9" },
        { "description": "`stats` command to track approval statistics during watch sessions", "commit": "cd362d9" },
        { "description": "`version` command to display build information", "commit": "cd362d9" },
        { "description": "Support for AWS Kiro CLI approval prompts (`tool use ... requires approval, press 'y' to approve`)", "commit": "cd362d9" },
        { "description": "Support for Claude Code approval prompts (`Allow? (Y/n)`, `Allow once`)", "commit": "cd362d9" },
        { "description": "Support for Codex CLI approval prompts (`Proceed? (Y/n)`)", "commit": "cd362d9" },
        { "description": "Support for Gemini CLI approval prompts (`(Y/n)` prompts)", "commit": "cd362d9" },
        { "description": "Dangerous command blocking for `rm -rf`, `sudo rm`, `mkfs`, `dd if=`, `curl|bash`, `wget|sh`, `chmod -R 777 /`", "commit": "cd362d9" },
        { "description": "Dry-run mode (`--dry-run`) to test detection without sending approvals", "commit": "cd362d9" },
        { "description": "Configurable scan interval (`--interval`) for responsive approval", "commit": "cd362d9" },
        { "description": "Session filtering (`--session`) to watch specific tmux sessions", "commit": "cd362d9" },
        { "description": "Verbose logging (`-v/--verbose`) for debugging", "commit": "cd362d9" },
        { "description": "macOS notifications support (`--notify`) for approval events", "commit": "cd362d9" },
        { "description": "Statistics tracking (`--stats`) with session summaries", "commit": "cd362d9" },
        { "description": "Duplicate approval prevention to avoid multiple keystrokes", "commit": "cd362d9" },
        { "description": "YAML configuration file support (`~/.agentsentinel.yaml`)", "commit": "cd362d9" },
        { "description": "Custom pattern configuration for additional prompt formats", "commit": "cd362d9" },
        { "description": "Shell completion scripts for bash, zsh, and fish", "commit": "cd362d9" }
      ],
      "documentation": [
        { "description": "Comprehensive README with quick start guide and multi-agent workflow examples", "commit": "3305791" },
        { "description": "Configuration file documentation with full example", "commit": "3305791" },
        { "description": "Troubleshooting guide for common issues", "commit": "3305791" }
      ],
      "build": [
        { "description": "GoReleaser configuration for multi-platform binary releases", "commit": "77ca6fa" },
        { "description": "GitHub Actions CI workflow for testing and linting", "commit": "77ca6fa" },
        { "description": "Makefile with build, test, lint, and install targets", "commit": "77ca6fa" }
      ]
    }
  ]
}
